*** Dispatching Electronic Vehicle Charging
# TODO: Explain $\Omega\!-\!\omega_{i}$
In the last step, at electricity delivery time, the EVs have to be assigned to
the VPP and be /dispatched/ to charge (see\circled{D} in Figure
ref:fig-control-mechanism). Therefore the controller needs to detect how many
EVs are eligible to be used as VPP in the control period $t$. An EV $i$ is
eligible if (a) it is connected to a charging station ($\c$ = 1), and (b) it has
enough free battery storage available ($\Omega\!-\!\omega_{i}$) to charge the
next control period. Hence, the VPP is defined as:
\begin{equation}
    V\!P\!P \defeq \{i\in\F \;|\; \c = 1 \vee \Omega\!-\!\omega_{i}\!\geq\!\gamma\Delta{t}\} \text{ ,}
\end{equation}
where $\gamma\Delta{t}$ (kWh) denotes the amount of energy that can be charged
with the charging speed of $\gamma$ (kW) in control period $t$. $\gamma$ is
limited by either the EVs build-in charger, or the charging power of the
connected charging station. In this model we assume $\gamma$ is equal for all
considered EVs and charging stations. /Example:/ Assuming a charging power of
$\gamma\!=\!3.3\kw$, an EV battery capacity of $\Omega\!=\!17.6\kwh$, and
control periods of 5 minutes, the amount of energy charged in one control period
is $3.3\kw\!\times\frac{5}{60}\text{h}\!=\!0.275\kwh$. Hence, the maximal
battery capacity to be eligible for VPP use is $17.6-\!0.275\!=\!17.325\kwh$.

#+BEGIN_SRC python :exports none
return(3.3 * (5/60))
#+END_SRC

#+RESULTS:
: 0.27499999999999997

#+BEGIN_SRC python :exports none
return(17.6 - 0.275)
#+END_SRC

#+RESULTS:
: 17.325000000000003

# TODO: How do we known $\oc$?
Remember that the fleet has to provide the total committed charging power
$\Pb{h}\!+\!\Pi{h}$ across all control periods $t$ of the market period $h$,
independent of which individual EVs are actually charging the electricity. This
fact allows the controller to dynamically dispatch EVs every control period and
react to unforeseen rental demand. If a customer wants to rent out an EV that is
assigned to the VPP, the controller only has to refuse the rental, if no other
EV is available to charge instead. When no replacement EV is available, the
controller has to account for lost rental profits $\oc$. If the VPPs total
amount of available charging power $\vpp{t}\!\times\!\gamma$ is not sufficient to
provide the total market commitments $\Pb{h}\!+\!\Pi{h}$, the fleet gets charged
imbalance costs $\beta_{h}$. Otherwise all the committed energy can be charged
by the VPP.

*** Example
At 3pm on the 9^{th} of August 2017, the controller enters the first bidding
phase for the market period $h$ = /16.08.2017 15:00-15:15/. It predicts that at
that point in time 250 EVs are connected to a charging station, resulting in
900kW available fleet charging power ($\fPhat{h}\!=\!900\kw$), given the
charging power of 3.6kW per EV. Assuming the available critical prices are
$\ccp{h}\!=\!5\emw$, $\cep{h}\!=\!-10\emwh$, and $\cup{h}\!=\!10\emwh$ in that
market period, the controller now evaluates the cheapest charging option. The
flat industry electricity tariff is assumed to be $p^{ind}\!=\!0.15\ekwh$. The
costs for charging with the maximal predicted amount of available power
$\fPhat{h}$ from the balancing market ($\Cb{h}(900\kw)\!=\!-6.25\eur$) are less
than charging from the intraday market ($\Ci{h}(900\kw)\!=\!2.25\eur$) or
charging at the industry tariff
($900\kw\!\times\!0.25\text{h}\!\times\!0.15\ekwh\!=\!33.75\eur$). In this
example, the fleet operator will even get compensated for charging its fleet, by
choosing the balancing market.

In the next step, the controller has to submit bids to the balancing market. The
RL agent determined that the risk of bidding on the balancing market is
$\lb{h}\!=\!0.3$. Consequently, the controller sets the bidding quantity to
$\Pb{h}\!=\!\fPhat{h}\!\times\!(1\!-\!\lb{h})\!=\!900\kw\!\times0.7\!=\!630\kw$
and submits a bid to the market and updates its account with
$\Cb{h}(630\kw)\!=\!-4.725\eur$.

One week later, 30 minutes before electricity delivery time, the controller
enters the second bidding phase. Due to the short time horizon, it predicts with
high accuracy that only $\fPhat{h}\!=\!810\kw$ is available for the same market
period /16.08.2017-15:00/. By trading at the intraday market, the controller can
now charge the remaining available EVs with a low risk of procuring more energy
than it can maximally charge. At this point in time, the RL agent determines a
remaining risk of $\li{h}\!=\!0.05$, and sets the bidding quantity to
$\Pi{h}\!=\!(810\kw\!-\!630\kw)\!\times\!(1\!-\!0.05)\!=\!171\kw$. The
controller procures 171kW from the intraday market and updates its account with
$\Ci{h}(171\kw)\!=\!0.4275\eur$.

At electricity delivery time, the 16^{th} of August 2017 at 3:00pm, the
controller detects 255 available EVs; EVs which are connected to a charging
station and have enough battery capacity left to be charged in the next control
period. It assigns 223 EVs to provide the total committed 801kW charging power
for the market period time $\Delta h$ of 15 minutes. During that time, three
customers want to rent out EVs that are allocated to the VPP. The first two
rentals are accepted because two other EVs are available to charge instead. The
third rental has be to refused, since no EV is remaining as substitution. The
controller has to account for the opportunity costs of the lost rental $\oc$.

#+BEGIN_SRC python :exports none :var h=15
def bal_cost(p_c, p_e, P):
    return(-(p_c * P * 0.001) + (p_e * P * (h/60) * 0.001))

return(bal_cost(5, -10, 630))
#+END_SRC

#+RESULTS:
: -4.725


#+BEGIN_SRC python :exports none :var h=15
def intraday_cost(p_u, P):
    return((p_u * P * (h/60) * 0.001))

return(intraday_cost(10, 171))
#+END_SRC

#+RESULTS:
: 0.4275

#+BEGIN_SRC python :exports none :var h=15
def industry_costs(p_i, P):
    return((p_i * P * (h/60)) / 100)

return(industry_costs(15, 900))
#+END_SRC

#+RESULTS:
: 33.75

#+BEGIN_SRC python :exports none
def pi(l):
    kw = (810 - 630) * (1 - l)
    return kw

return(pi(0.05))
#+END_SRC

#+RESULTS:
: 171.0

#+BEGIN_SRC python :exports none :var h=15
kw = 630  + 171
return(kw)
#+END_SRC

#+RESULTS:
: 801


# Assume:
# - Bid maximum capacity price?
# - What about balancing capacity prices? Future work?

# Other assumptions:
# 2) EV fleet charges at a fixed industry tariff otherwise

# - Fleet capacity prediction made on non-simulated real-world SoC (w/o smart charging)?
# - Fleet capacity predictions with simulated data?
#   - Provide difference levels & descriptive statistics?


*** Markov Decision Process Definition

MDPs are defined by the state space $\S$, the action space $\A$, a set of reward
signals $\R$ and the state-transition probabilities $p(s'|a,s)$. When
$p(s'|a,s)$ is unknown, as it is in our case, it is possible to use a
model-free approach (see Chapter ref:sec-td-learning). The state space
compromises the observed information the agent uses to decide on the action it
is going to take. We observed the following factors that are associated with the
bidding risk:
1) The bidding period's time of the day

   In times of volatile customer rental demand (e.g., during rush hour), the
   uncertainty on the guaranteed amount of available EVs increases. Bidding for
   these periods involves a higher risk of not being able to fulfill market
   commitments.
2) The current and estimated future size of the VPP

   Large VPPs benefit from the /risk-pooling/ effect cite:kahlen17_fleet.
   Intuitively that means, larger VPPs are exposed to smaller risks: They have
   an increased probability that "lost" charging power, due to unforeseen
   rentals, can be substituted by the EVs of the VPP.

# NOTE: Features as state space?
Since forecasts of available charging power are already available, we define the
predicted VPP size $\vpphat{h}$ as the as the necessary amount of EVs to provide
the predicted charging power $\fPhat{}$ in time period $h$:
\begin{equation}
    \vpphat{h} \defeq \left\lceil\frac{\fPhat{h}}{\gamma}\right\rceil \text{ ,}
\end{equation}
where $\gamma$ is the charging power per EV. /Example:/ When the controller
predicted 910kW available charging power, the estimated future
size of the VPP to charge with the predicted power is  =ceil(= $\!910\kw /
3.6\kw\!$ =)= = 253.


#+BEGIN_SRC python :exports none
import math
def vpp(p, gamma):
    return(math.ceil(p /  gamma))

return(vpp(910, 3.6))
#+END_SRC

#+RESULTS:
: 253


The state space is then defined as
the set of all valid values of the elements of the following tuple:
\begin{equation}
    \S \defeq \left\langle t(h), \vpp{h}, \vpphat{h+2}, \vpphat{h+(7\!\times\!H)}\right\rangle \text{ ,}
\end{equation}
where:
- $t(h)$ is the current daytime in hours, with discrete values in the range
  $\big[0,\;23\big] \in \Ne$.
- $|VPP|_t$ is the current VPP size, with discrete values in the range
  $\big[0,\;|\F|\big] \in \Ne$.
- $\vpphat{h+2}$ is the predicted VPP size 30 minutes ahead, with discrete values in the range
  $\big[0,\;|\F|\big] \in \Ne$.
- $\vpphat{h+(7\!\times\!H)}$ is the predicted VPP size 7 days ahead, with discrete
  values in the range $\big[0,\;|\F|\big] \in \Ne$.
The state space encompasses $|\F|^3\!\times\!24$ states. Assuming a fleet size
$|\F|$ of 500 EVs, the state space consists of $3\!\times\!10^9$ different states.

#+BEGIN_SRC python :exports none
import math
return(24 * math.pow(500,3))
#+END_SRC

#+RESULTS:
: 3000000000.0

The agent takes actions by determining the risk that is associated with bidding
on the electricity markets at each market period $h$. Hence, the action space is
constituted by all combinations of valid values of the risk factors
$\lb{},\li{}$:
\begin{equation}
    \A \defeq \left\{\lb{},\li{} \in \Re_{0 \leq \lambda \leq 1} \right\} \text{ ,}
\end{equation}
where:
- $\lb{}$ is the risk factor for bidding on the balancing market 7 days ahead,
  with discrete values in the range $\big[0,1\big]$ in 0.05 increments.
- $\li{}$ is the risk factor for bidding on the intraday market 30 minutes
  ahead, with discrete values in the range $\big[0,1\big]$ in 0.05 increments.
The action space encompasses $20^2 = 400$ actions. The state space and action
space were consciously discretized to achieve faster learning rates. Convergence
in continuous spaces is theoretically achievable, but computationally more
complex cite:sutton18_reinf. In order to facilitate faster learning in
real-world settings, where long training periods are not desirable, we chose to
not pursue this direction.

# NOTE: Reward structure, possibilities
The reward signal is naturally defined as the fleet costs that occurred in the last
time step. When accumulating the rewards for all time steps, we arrive at the total
fleet costs, which we aim to minimize:
\begin{equation}
    R_{h+1} = \Cf{h} - \Cf{h-1} \text{ ,}
\end{equation}
where $\Cf{h}$ are the total accumulated fleet costs until the market period
$h$. For a complete formulation of the cost function see
\eqref{eq-model-fleetcosts}. The agent's actions directly determine the occurred
costs or profits, and are presented to the agent in form of a positive or
negative reward signal. The particular challenge in the proposed RL problem is
the significantly /delayed reward/. Choosing a risk factor in time step $h$
determines the reward up to 672 time steps later (7 days, with 15-minute time
steps), when the electricity from the balancing market has to be charged.

#+BEGIN_SRC python :exports none
return(7 * 24 * 4)
#+END_SRC

#+RESULTS:
: 672
